app/views/quotes/_form.html.erb

  <div class="form-group" style="padding-bottom: 10px;">
    <%= f.select :philosopher_id, Philosopher.all.collect { |p| ["#{p.fname} #{p.lname}", p.id] }, prompt: 'Select a Philosopher', class: "form-control" %>
---
SELECT "philosophers".* FROM "philosophers"

  <div id="categories-container">
    <% @quote.quote_categories.each do |quote_category| %>
---
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 20]]

            <%= qc.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
            <%= qc.select :category_id, Category.all.collect { |cat| [cat.category, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"