app/views/quotes/_form.html.erb

          <!-- Dropdown to select a category -->
          <%= qc.select :category_id, Category.all.collect { |cat| [cat.category, cat.id] }, { include_blank: 'Select a category...' }, class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"

  <div class="form-group" style="padding-bottom: 10px;">
    <%= f.select :philosopher_id, Philosopher.all.collect { |p| ["#{p.fname} #{p.lname}", p.id] }, prompt: 'Select a Philosopher', class: "form-control" %>
---
SELECT "philosophers".* FROM "philosophers"

        <div class="col-auto">
          <%= qc.select :category_id, Category.all.collect { |cat| [cat.category, cat.id] }, { include_blank: 'Select a category...' }, class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"