app/views/quotes/_quote.html.erb

    <br>
    <% if quote.philosopher.death_year.present? %>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    <% end %>
    <% if quote.philosopher.biography.present? %>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]