app/views/search/index.html.erb

            <ul>
              <% philosopher.quotes.each do |quote| %>
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."philosopher_id" = ?  [["philosopher_id", 4]]