app/views/home/aindex.html.erb

<% if logged_in? %>
    <p>Hello, <%= User.find(session[:user_id]).fname %>!</p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]