app/views/home/index.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
      <%= @quote_of_the_day.philosopher.fname %>
      <% if @quote_of_the_day.philosopher.lname.present? %> <!-- Check if the last name exists -->

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?, ?, ?)  [["id", 15], ["id", 14], ["id", 11], ["id", 2]]
---
        <%= quote.philosopher.fname %>
        <% if quote.philosopher.lname.present? %> <!-- Check if the last name exists -->