app/views/home/uindex.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
<% if session[:user_id] %>
    <p>Hello, <%= User.find(session[:user_id]).fname %>!</p>