app/views/home/uquotes.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?)  [["id", 11], ["id", 14]]
---
                  <!-- Check if the philosopher has a last name and if so, display it -->
                  <% if quote.philosopher.lname.present? %>