app/controllers/categories_controller.rb

INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Axiology"], ["created_at", "2023-10-09 05:32:36.018623"], ["updated_at", "2023-10-09 05:32:36.018623"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save