app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" LIMIT ?  [["LIMIT", 5]]
---
  def index

    # Quote of the day logic
    daily_seed = Date.current.yday % Quote.count
    @quote_of_the_day = Quote.offset(daily_seed).first

    # Recently added quote logic
    @quotes = Quote.includes(:philosopher).take(5)