app/controllers/home_controller.rb

  def index

    # Quote of the day logic
    daily_seed = Date.current.yday % Quote.count
    @quote_of_the_day = Quote.where(is_public: true).offset(daily_seed).first

    # Recently added quote logic
    @recent_quotes = Quote.includes(:philosopher).where(is_public: true).order(created_at: :desc).limit(5)
---
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 15]]
SELECT COUNT(*) FROM "quotes"
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = ? ORDER BY "quotes"."id" ASC LIMIT ? OFFSET ?  [["is_public", 1], ["LIMIT", 1], ["OFFSET", 16]]
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?, ?, ?, ?)  [["id", 1], ["id", 3], ["id", 2], ["id", 9], ["id", 4]]

  def uquotes
    @quotes = Quote.includes(:philosopher).where(user_id: session[:user_id])
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?)  [["id", 2], ["id", 9]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 2]]