app/controllers/philosophers_controller.rb

  def index
    @philosophers = Philosopher.all
---
SELECT "philosophers".* FROM "philosophers"

  def create
    @philosopher = Philosopher.new(philosopher_params)

    respond_to do |format|
      if @philosopher.save
---
INSERT INTO "philosophers" ("fname", "lname", "birth_year", "death_year", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @philosopher.destroy
---
DELETE FROM "philosophers" WHERE "philosophers"."id" = ?  [["id", 12]]

    def set_philosopher
      @philosopher = Philosopher.find(params[:id])
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]