app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.where(is_public: true)
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = ?  [["is_public", 1]]

  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("text", "pub_year", "comment", "is_public", "user_id", "philosopher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @quote.update(quote_params)
---
UPDATE "quotes" SET "is_public" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["is_public", 0], ["updated_at", "2023-10-07 02:53:13.078590"], ["id", 22]]