app/controllers/search_controller.rb

  def index
    # Fetch all available categories
    @all_categories = Category.all

    # Grab the category query parameter from the URL
    category_query = params[:category_query]

    if category_query.present?
      # If category query parameter is present find the corresponding category from the database
      category = Category.find(category_query)

      # Retrieve all the quotes associated with the selected category
      @category_match = category.quotes.includes(:philosopher).where(is_public: true)
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?, ?)  [["id", 3], ["id", 7], ["id", 6]]
SELECT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quotes"."id" = "quote_categories"."quote_id" WHERE "quote_categories"."category_id" = ? AND "quotes"."is_public" = ?  [["category_id", 5], ["is_public", 1]]