app/controllers/search_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."philosopher_id" = ?  [["philosopher_id", 4]]
SELECT DISTINCT "philosophers".* FROM "philosophers" WHERE (fname LIKE '%Kant%' OR lname LIKE '%Kant%')
---
  def index
    philosopher_query = params[:philosopher_query]
    if philosopher_query.present?
      @philosopher_match = Philosopher.includes(:quotes).where("fname LIKE ? OR lname LIKE ?", "%#{philosopher_query}%", "%#{philosopher_query}%")