app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "pauljamescottrell@gmail.com"], ["LIMIT", 1]]
---
  def create
    # Find a user by the email provided
    user = User.find_by(email: params[:email])